/*
 Localization provided by Wordcrafts
 The Mac OS X and iOS localization experts.
 http://www.wordcrafts.de
 */


/* General */

/* For dialogs yes buttons */
"HockeyYes" = "Yes";

/* For dialogs no buttons */
"HockeyNo" = "No";

/* For dialogs ok buttons */
"HockeyOK" = "OK";

/* Replacement for app name, if it could not be detected */
"HockeyAppNamePlaceholder" = "This app";

/* Crash */


/* Crash dialog */

/* Title showing in the alert box when crash report data has been found */
"CrashDataFoundTitle" = "%@ Unexpectedly Quit";

/* Description explaining that crash data has been found and ask the user if the data might be uploaded to the developers server */
"CrashDataFoundAnonymousDescription" = "Would you like to send an anonymous report so we can fix the problem?";

/* Description explaining that crash data has been found and ask the user if the non anonymous data might be uplaoded to the developers server */
"CrashDataFoundDescription" = "Would you like to send a report so we can fix the problem?";

/* Alert box button if the users wants to send crash data always automatically */
"CrashSendReportAlways" = "Always Send";

/* Alert box button to send the crash report once */
"CrashSendReport" = "Send Report";

/* Alert box button to decline sending the report */
"CrashDontSendReport" = "Don't Send";

/* Text showing in a processing box that the crash data is being uploaded to the server */
"CrashReportSending" = "Sending…";


/* Update */


/* Update Alert view */

/* Update available */
"UpdateAvailable" = "Update available";

"UpdateAlertTextWithAppVersion" = "%@ is available.";

"UpdateAlertMandatoryTextWithAppVersion" = "%@ is available and is a mandatory update!";

"UpdateIgnore" = "Ignore";

"UpdateShow" = "Show";

"UpdateInstall" = "Install";

"UpdateRemindMe" = "Remind me";


/* Update Details */

"UpdateScreenTitle" = "Update";

"UpdateButtonCheck" = "CHECK";

"UpdateButtonSearching" = "CHECKING";

"UpdateButtonUpdate" = "UPDATE";

"UpdateButtonInstalling" = "INSTALLING";

"UpdateButtonOffline" = "OFFLINE";

"UpdateInstalled" = "INSTALLED";

"UpdateVersion" = "Version";

"UpdateShowPreviousVersions" = "Show previous versions...";

"UpdateNoUpdateAvailableTitle" = "No Update Available";

"UpdateNoUpdateAvailableMessage" = "%@ is already the latest version.";

"UpdateError" = "Error";

"UpdateWarning" = "Warning";

"UpdateNoReleaseNotesAvailable" = "No release notes available.";


/* Update Authorization  */

"UpdateAuthorizationProgress" = "Authorizing...";

"UpdateAuthorizationOffline" = "Internet connection required!";

"UpdateAuthorizationDenied" = "Authorizing denied. Please contact the developer.";


/* Update Expiry  */

"UpdateExpired" = "%@ is expired and can not be used any longer.";


/* Update Simulator Warning */

"UpdateSimulatorMessage" = "Hockey Update does not work in the Simulator.\nThe itms-services:// url scheme is implemented but nonfunctional.";


/* Feedback */


/* New Message Alert */

/* Alert Title */
"HockeyFeedbackNewMessageTitle" = "New Feedback Response";

/* Alert Text */
"HockeyFeedbackNewMessageText" = "A new response to your feedback is available. Would you like to view it?";

/* Alert Ignore Button */
"HockeyFeedbackIgnore" = "Ignore";

/* Alert Show Button */
"HockeyFeedbackShow" = "Show";


/* List View */

/* Title */
"HockeyFeedbackListTitle" = "Feedback";

/* Last Updated */
"HockeyFeedbackListLastUpdated" = "Last Updated: %@";

/* Never Updated */
"HockeyFeedbackListNeverUpdated" = "Never";

/* Provide Feedback Button Title */
"HockeyFeedbackListButtonWriteFeedback" = "Provide Feedback";

/* Add a Response Button Title */
"HockeyFeedbackListButtonWriteResponse" = "Add a Response";

/* User Data Set Name Button Title */
"HockeyFeedbackListButtonUserDataSetName" = "Set Your Name";

/* User Data Set Email Button Title */
"HockeyFeedbackListButtonUserDataSetEmail" = "Set Your Email";

/* User Data With Name Button Title */
"HockeyFeedbackListButtonUserDataWithName" = "Name: %@";

/* User Data With Email Button Title */
"HockeyFeedbackListButtonUserDataWithEmail" = "Email: %@";

/* Button title for deleting all local messages*/
"HockeyFeedbackListButtonDeleteAllMessages" = "Delete All Messages";

/* Message pending to be send */
"HockeyFeedbackListMessagePending" = "Pending";


/* Delete All Messages Action Sheet / Alert View */

/* Title for the Action Sheet */
"HockeyFeedbackListDeleteAllTitle" = "This will delete all messages on this device.";

/* Button Title to perform delete action */
"HockeyFeedbackListDeleteAllDelete" = "Delete";

/* Button Title to cancel delete action */
"HockeyFeedbackListDeleteAllCancel" = "Cancel";


/* Open Link In Safari Action Sheet / Alert View */

/* Button Title to cancel */
"HockeyFeedbackListLinkActionCancel" = "Cancel";

/* Button Title to Open the Link */
"HockeyFeedbackListLinkActionOpen" = "Open";

/* Button Title to Copy the Link */
"HockeyFeedbackListLinkActionCopy" = "Copy";


/* UIActivity */

/* Activity Sharing Button Title, App Name will be inserted */
"HockeyFeedbackActivityButtonTitle" = "%@ Feedback";

/* if there can no app name be found, use this instead for HockeyFeedbackActivityButtonTitle */
"HockeyFeedbackActivityAppPlaceholder" = "App";


/* Compose Message */

/* Title */
"HockeyFeedbackComposeTitle" = "New Feedback";

/* Send button */
"HockeyFeedbackComposeSend" = "Send";

/* Add Image button for attachment actions */
"HockeyFeedbackComposeAttachmentAddImage" = "Add Image";

/* Edit button for attachment actions */
"HockeyFeedbackComposeAttachmentEdit" = "Edit Image";

/* Delete button for attachment actions */
"HockeyFeedbackComposeAttachmentDelete" = "Delete Image";

/* Cancel button for attachment actions */
"HockeyFeedbackComposeAttachmentCancel" = "Cancel";


/* Set User Data */

/* Title */
"HockeyFeedbackUserDataTitle" = "My Info";

/* Description On What Should Be Entered */
"HockeyFeedbackUserDataDescription" = "Please provide your information before writing your feedback.";

/* Name Field */
"HockeyFeedbackUserDataName" = "Name";

/* Name Placeholder */
"HockeyFeedbackUserDataNamePlaceHolder" = "John Doe";

/* Email Field */
"HockeyFeedbackUserDataEmail" = "Email";

/* Email Placeholder */
"HockeyFeedbackUserDataEmailPlaceholder" = "email@example.com";


/* Authenticator */

/* View Controller Title*/
"HockeyAuthenticatorViewControllerTitle" = "HockeyApp";

/* BITAuthenticatorAuthTypeUDIDProvider */
"HockeyAuthenticationViewControllerWebUDIDLoginDescription" = "The developer has requested this device's UDID. Tap below to open the HockeyApp website and authorize access.";
"HockeyAuthenticationViewControllerWebLoginButtonTitle" = "Open HockeyApp";

/* BITAuthenticatorIdentificationTypeWebAuth */
"HockeyAuthenticationViewControllerWebAuthLoginDescription" = "The developer has requested your HockeyApp account's email address. Tap below to open the HockeyApp website and authorize access.";

/* BITAuthenticatorAuthTypeEmail and BITAuthenticatorAuthTypeEmailAndPassword */
"HockeyAuthenticationViewControllerDataEmailAndPasswordDescription" = "Please enter your HockeyApp account's email address and password to authorize access to this app.";
"HockeyAuthenticationViewControllerDataEmailDescription" = "Please enter your HockeyApp account's email address to authorize access to this app.";
"HockeyAuthenticationViewControllerEmailPlaceholder" = "email@example.com";
"HockeyAuthenticationViewControllerPasswordPlaceholder" = "Required";
"HockeyAuthenticationViewControllerEmailDescription" = "Email";
"HockeyAuthenticationViewControllerPasswordDescription" = "Password";

/* Error presented to the user if authentication failed because of networking issues */
"HockeyAuthenticationViewControllerNetworkError" = "Failed to authorize because your device appears to be disconnected from the Internet. Please try again.";

"HockeyAuthenticationFailedAuthenticate" = "Failed to authorize. Please try again or contact the developer of this app.";
"HockeyAuthenticationNotMember" = "You are not authorized to use this app. Please contact the developer of this app.";
"HockeyAuthenticationContactDeveloper" = "Authorization error. Please contact the developer of this app.";
"HockeyAuthenticationWrongEmailPassword" = "You have entered an invalid email or password. Please check your input and try again.";
"HockeyAuthenticationAuthSecretMissing" = "The HockeySDK authorization secret has not been set. Please contact the developer of this app.";

/* Accessibility strings */
"HockeyAccessibilityHintRequired" = "Required";
